---

C#Visual BasicVisual C++

Revit 2024 API
---
FamilyInstance..::..SuperComponent Property
FamilyInstance Class See Also Send Feedback
---

Property to get the super component of current family instance.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)

# Syntax

C#
---

    public Element SuperComponent { get; }

Visual Basic
---

    Public ReadOnly Property SuperComponent As Element
    	Get

Visual C++
---

    public:
    property Element^ SuperComponent {
    	Element^ get ();
    }

# Remarks

When the FamilyInstance has no super component, it returns nullNothingnullptra null reference (Nothing in Visual Basic)

# See Also

FamilyInstance Class

Autodesk.Revit.DB Namespace